do 

local function run(msg, matches) 

local reply_id = msg['id'] 
if is_momod(msg) and matches[1] == '#المطور' then 
    local ghost = [[ 
☑️ اوامر المطور في المجموعه ☑️

⚠️➖⚠️➖⚠️➖⚠️➖⚠️➖⚠️

☑️تفعيل  —-  لتفعيل البوت في المجموعه ☑️✅
☑️تعطيل  —-  لتعطيل البوت في المجموعه ❎🔘
☑️ترقيه سوبر  —-  لترقية المجموعه الى سوبر 💯
☑️كشف بوت  —-  لكشف البوتات في المجموعه ☠🚫
☑️اضف مطور   —-   لاضافة مطور في البوت 👮🏻⚙
☑️تفعيل لمده + المده   —-   لتفعيل البوت لمدة معينه في المجموعه ⚖🔋
☑️الملفات  —-  لعرض الملفات في البوت 🎮
☑️تفعيل ملف  —-  لتفعيل ملف معين في البوت 👾
☑️تعطيل ملف  —-  لتعطيل ملف معين في البوت 📿
☑️الملفات المفعله  —-  لعرض الملفات المفعله في المجموعه 🕹
☑️الدعم  —-  لعرض كروب دعم البوت 🕹♨️ 
☑️جلب ملف  —-  لجلب ملف من البوت 🖨
☑️اضافه+معرف  —-  لاضافة عضو بواسطة البوت 👤✅
☑️صنع مجموعه  —-  لصنع مجموعه بواسطة البوت 👥✅
☑️طرد البوت  —-  لطرد البوت من المجموعه 📤💢
☑️معلومات السيرفر  —-  لعرض معلومات السيرفر 📈🖋
☑️طرد الكل  —-  لطرد الاعضاء من المجموعه 💢👟

▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁ 
🎿ᗦЄᏤ:: @l56l_l  🎗 

  ]] 
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "Only Owner or Mod !" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(المطور)$", 
}, 
run = run 
} 
end 
