do
ws = {}
rs = {}

-- some examples of how to use this :3 
ws[1] = "هلو" -- msg 
rs[1] = "  هْـٌﮩٌﮧٌ﴿🙃﴾ۙﮩٌـ୭ٌ୭ـْلوُّات†😻☝️  " -- reply

ws[2] = "سعد" -- msg
rs[2] = "تكدر تراسله خاص عالمعرف \n@saad7m\nواذا محضور عله بوت التواصل هذه\n@saad7m_bot" -- reply

ws[3] = "شلونكم" -- msg
rs[3] = "تٌـٌـمـــ༄༅ـٌـٌإأإآمـ و اٍْنـْﱡِـ👈youـٍُتٍۜة ☺️🌹" -- reply

ws[4] = "بوسني" -- msg 
rs[4] = " ٲٳٲمــﮨ﴿💋﴾ﮨﮨﮨﮨ﴿😚﴾ﮨــوٱآاﮨـٍٰۣۗح✵❤ لحليكك/ج " -- reply

ws[5] = "احبك" -- msg 
rs[5] = "صـ❲❥❳ـہۣۙدگـﮧِّ† 😻🙌 خـجـ😅ـلت" -- reply

ws[6] = "سنايبر" -- msg 
rs[6] = "عـ௸👀ﻴﻨﮥ ﴿😌﴾وخـ௸شمه"-- reply

ws[7] = "باي" -- msg 
rs[7] = "وين الله وياك" -- reply

ws[8] = "اكرهك" -- msg 
rs[8] = "عـلساس آٌنـّ'ℳέ'ـّي أحـبٍّـٍـٍـُـِՀօvεٍـٍـٍكـُّ💓 😝" -- reply

ws[9] = "اتفل" -- msg 
rs[9] = "خخخخـ😩ـخخخ تفـ💦ـووووو💦💦" -- reply

ws[10] = "زنوبه" -- msg 
rs[10] = "اﯛﯛﯛﯛيــْـــلـٍـيٍِ❥ عـلـ🍃ـيهه صـ🌚❤️ـاكه" -- reply

ws[11] = "منوره" -- msg 
rs[11] = "💖💔 حبي الاولي💖💔 😍" -- reply

ws[12] = "مرحبا" -- msg 
rs[12] = "مـراحـ🌹ـب نـورت/ي🌹🍃" -- reply

ws[13] = "انجب" -- msg 
rs[13] = "حـﮩ๋͜͡❀ـﷻُــّاضر حـৡﮩـبـஆ✺ـي"-- reply

ws[14] = "زاحف" -- msg 
rs[14] = "زاحف ع اختك مثلا���️🏽️" -- reply

ws[15] = "تعالي خاص"-- msg 
rs[15] = "ها ها زااااحف" -- reply


ws[16] = "قناتي" -- msg 
rs[16] = "https://telegram.me/kenam_bot_plus_saad7m" -- reply

ws[17] = "حمودي" -- msg 
rs[17] = "صـ😻ــاك الكـgяθυρـٍْـْْروب 🌚🌹"
-- the main function
ws[18] = "شسمج" -- msg 
rs[18] = "سَّنِّآيِّبٍّرِهِّ 😝" -- reply

ws[19] = "طن" -- msg 
rs[19] = "شـ͜ஊـعندك ط͜ணேـنطن ﯾ﴿😂﴾ﻤـي"-- rep

ws[20] = "بتيخه" -- msg 
rs[20] = "ضـ🌚❤️ــلعة عــ😴🍃ـلــوش" -- reply

ws[21] = "السلام عليكم" -- msg 
rs[21] = "ۆعلـِْ♡̨̐ـِْيگمَ آلسَـِْ♡̨̐ـِْامَ" -- reply

ws[22] = "امثال" -- msg 
rs[22] = "ام غمازات تروحلهه فدوه الجكمات" -- rep

ws[23] = "😒" -- msg 
rs[23] = "ﺷﺒﮧ❃ہيكہ/ج.  كالب خـلـ🌚ـقتك🚶🏻" -- rep

ws[24] = "🌚" -- msg
rs[24] = "شبيك/ج الله مصخم وجهك بكل الكروبات" -- rep

ws[25] = "بوسه" -- msg
rs[25] = "امــہـ😘😚😘😚😘ــہــواااااح" -- rep

ws[26] = "دكول شكد" -- msg
rs[26] = "تخيل انته حبل وتشد ركبتي لو احس بروحي تطلع ما اكولك" -- rep

ws[27] = "احبك" -- msg
rs[27] = "غير انته/ي عشقي" -- rep

ws[28] = "وليد" -- msg
rs[28] = "اخ الله منه ابو البنات هاذ😉😸☝" -- rep

ws[29] = "اريد جاي"-- msg
rs[29] = "مہيَل😊ُ لُۆ بْدِۆنْ ✋" -- rep

ws[30] ="اوف" -- msg
rs[30] = "هْٱ ضٍآربْگ /جٍ بْۆريَ آلُيَۆم" -- rep

ws[31] = "سيوفي" -- msg
rs[31] = "النبض ماتي 😋✌ فديتا 😉😍" -- rep

ws[23] = "تمام" -- msg
rs[23] = "⌣{دِْۈۈۈۈ/يّارٌبْ_مـْو_يـّوّمٌ/ۈۈۈۈمْ}⌣" -- rep

ws[33] = "دوم" -- msg
rs[33] = "⌣{يـّـٌدِْۈۈ/عّزٌگ-ۈنَبْضّ قَلبْگ/ۈۈمْ}⌣" -- rep

ws[34] = "منور" -- msg
rs[34] = "نِْـِْـــِْ([💡])ِْــــًِـًًْـــِْـِْـِْـورِْكِْ" -- rep

ws[35] = "ها" -- msg
rs[35] = "❀وجـٌٌৡــٌۣۙ﴿ýøû﴾ــৡـعا๛❀🌚" -- rep

ws[36] = "دخن" -- msg
rs[36] = "🚬 😌" -- rep

ws[37] = "احمد"-- msg
rs[37] = "فـۙ✯ود͡يت ربـ﴿ُ😍﴾ـه شـ❦ـكـ๘ً҉ـد احبه"-- rep

ws[38] = "😒"-- msg
rs[38] ="ﺷﺒﮧ❃ہيكہ/ج.  كالب خـلـ🌚ـقتك🚶🏻"--rep���

ws[39] = "حموشي"-- msg
rs[39] = "مطـஊـور❣﴿ﷻ﴾❣مالتي فـُ↹ـوديته"-- rep

ws[40] = "احم"-- msg
rs[40] = "ٱجَےـيّبِلَګ مِﮯيَ سُـ‘ـُتُـ‘ـُأذٍِيِّ😒"--rep

ws[41] = "علوش"-- msg
rs[41] = "جّـنِنِتٌـ کْلَ أّلَنِأّسِـ يِّفُـلَأّنِ  وٌلَيِّتٌـحًدٍئ خِـسِـرأّنِ😌✌️"-- rep

ws[42] = "اريد ببسي"-- msg
rs[42] = "تدلل يم خالتك حته ميرنده عدها 😉☺"--rep

ws[43] = "سجودي" -- msg
rs[43] = "فديت ربه شكد احبه ❤😘"--rep

ws[44] = "فيصل"-- msg
rs[44] = "فديت الله الخلقه" -- rep

ws[45] = "شوشه"-- msg
rs[45] = "فديتها عيونها تموت" -- rep

ws[46] = "هجوره"-- msg
rs[46] = "اموره الكروب"--  rep

ws[47] = "دلوش"-- msg
rs[47] = "الحلوه ماتي"-- rep

ws[48] = "سارونه"-- msg
rs[48] = "😍❤ام لوجين فديتها😍❤" -- rep

ws[49] = "اتخليني"-- msg
rs[49] = "آخِّلِّيِّﮝ عَّلِّىِّ رِآسَّيِّ😝"--rep

ws[50] = "سروش"-- msg
rs[50] = "هّـأّيِّ ضًـلَعٌتٌـيِّ لَحًدٍ يِّنِدٍکْ بًيِّهّـأّ😍" -- rep

ws[51] = "قزومه"--msg
rs[51] = "امج جابتج واحنه ابتلينه يالطولج شبر شمسويه بينه🙈😹☝️"-- rep

ws[52] = "@saad7m"-- msg
rs[52] = "حتمال مشغول تكدر تناقشه ع خاص"-- rep

ws[53] = "شسمك"-- msg
rs[53] = "❁سـ✮ﮩ๋͜͡ــ❣ــنايـ﴿卍﴾ــৡــ↹ـبر❁"-- rep

ws[54] = "مطورين"-- msg
rs[54] = "@saad7m_bot تعالو محتاجيكم"-- rep

ws[55] = "ابو فهد"-- msg
rs[55] = "دولـ❁ـة✬وعـ௮ہـلم✾بعد خلـ✮๋͜͡‏❣ـلتك❦"-- rep

ws[56] = "تحبني" -- msg
rs[56] = "لووووو تدري شكد" -- rep

ws[57] = "😂"-- msg
rs[57] = "«يـ•ـஓـضحـ•ـﷻـ•ـك الـًَّۜۙۥـ﴿😹﴾ـفطِـ❅ـيَرْ"--rep

ws[58] = "🌝"-- msg
rs[58] = "نُـ(⊙﹏⊙)ـورتً حٍـبْيَ¶"-- rep

ws[59] = "مروش"-- msg
rs[59] = " فديتها 😍❤️🙊صاكة الكروب🙊❤️"-- rep

ws[60] = "ملاك"-- msg
rs[60] = "وٌصّـعٌبً أّلَأّمًتٌـلَأّکْ😍😻🙈"-- rep

ws[61] = "هاي كيك"-- msg
rs[61] = "هـ﷽ـلاو‎﴿❥﴾شــ🍻ﮍبت"-- rep

ws[62] = "وينكم"-- msg
rs[62] = "نـಘـايـೋـمين بل خـ❥ــ❦ـاص"-- rep

ws[63] = "اجيت" -- msg
rs[63] = "هےـَِــْـِْـْْـِلَآّ﴿☺️﴾وُغّےـلَآ ﴿🌞﴾نٌےـوُرَت" -- rep

ws[64] = "ظاهر" -- msg
rs[64] = "هّـذِأّ ضًـلَعٌيِّ لَحًدٍ يِّنِدٍکْ بًيِّهّ🙈 😍💪" -- rep

ws[65] = "@A_A_A96" -- msg
rs[65] = "حتمال مشغول تكدر تناقشه خاص🌚😑" -- rep

ws[66] = "هلاو"-- msg
rs[66] = "هِــلَأّوِأّتّ حٌـــبِيِّ" -- rep

ws[67] = "زهراء" -- msg
rs[67] = "فديت الله الخلقه😍😘" -- rep

ws[68] = "ايوشه" -- msg
rs[68] = "حبيبه😍 احمد❤ لتتقربولها✋😈" -- rep

ws[69] = "عبودي" -- msg
rs[69] = "هذا ضلعي فديته لو اندل بيته 😍😍" -- rep

ws[70] = "علو" -- msg
rs[70] = " عبودي عرفتك رحمه لبوك لا تشاقه😂✋" -- rep

ws[71] = "زاحف" --  msg
rs[71] = "زاحف عله اختك مثلا 😒😑" -- rep

ws[72] = "شكو ماكو" -- msg
rs[72] = "‘°ºø•❤•.¸✿¸.•❤•.❀•. (😍غيرك بالكلب ماكو ) .•❀.•❤•.¸✿¸.•❤•øº°‘" -- rep

ws[73] = "نونه" -- msg
rs[73] = "قزومه والهيبه تسطر 😏" -- rep

ws[74] = "اسراء" -- msg
rs[74] = "مدريديه للنخاع😍" -- rep

ws[75] = "روان" -- msg
rs[75] = " 😍✌فديتها الضلعه هاي" -- rep

ws[76] = "قويه" -- msg
rs[76] = "بس ماعدها عضلات 😂🌚" -- rep

ws[77] = "منو هنا" -- msg
rs[77] = "خااالتك 🌚😂🙊" -- rep

ws[78] = "شلونك" -- msg
rs[78] = "احــــســ{😜}ــــن منــــ{😌}ــــك" -- rep

ws[79] = "😕" -- msg
rs[79] = "عود هوه ضايج 😒😒" -- rep

ws[80] = "دنو" -- msg
rs[80] = "فديت عيونها 😍😘" -- rep

ws[81] = "دندونه" -- msg
rs[81] = "يومه😍النبض مال اني 😉❤" -- rep

 -- the main function
function run( msg, matches )
 -- just a local variables that i used in my algorithm  
 local i = 0; local w = false

 -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
 -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
 for k,v in pairs(ws) do
  -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
  if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
   -- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
   i = k; w = true;
  end
 end

 -- check if { w } is not false and { i } not equals to 0
 if ( (w ~= false) and (i ~= 0) ) then
  -- get the receiver :3 
  R = get_receiver(msg)
  -- send him the proper message from the index that { i } assigned to
  --send_large_msg ( R , rs[i] );
  --send_reply(msg.id, rs[i])
  reply_msg(msg.id, rs[i], ok_cb, false )
 end
 
 -- don't edit this section
 if ( msg.text == "about" ) then
  if ( msg.from.username == "Mouamle" ) then
   R = get_receiver(msg)
   send_large_msg ( R , "Made by @Mouamle" );
  end
 end 

end



return {
 patterns = {
  "(.*)"  
   },
   run = run
} 


end